gojimmypi/wolfssl-examples/ESP32/TLS13-ENC28J60-server/main/enc28j60_example_main.c
    /* 
    ***************************************************************************
    *  Connect the TCP socket to the server (no encryption yet!) 
    *  
    *  #include <sys/socket.h>
    *  int connect(int socket, const struct sockaddr *address, socklen_t address_len);
    *  
    *  See https://linux.die.net/man/3/connect
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        /*
         * Upon successful completion, socket() shall return a non-negative integer, 
         * the socket file descriptor. 
         * 
         * Upon successful completion, connect() shall return 0; otherwise, 
         * -1 shall be returned and errno set to indicate the error.
         */
        int connectResult = connect(sockfd, (struct sockaddr*) &servAddr, sizeof(servAddr));
        if (0 == connectResult) {
            WOLFSSL_MSG("sockfd connect successful\n");
        }
        else {
            // TODO show errno
            WOLFSSL_ERROR_MSG("ERROR: socket connect failed\n");
            ret = WOLFSSL_FAILURE;
        }
    }
    else {
        WOLFSSL_ERROR_MSG("Skipping socket connect.\n");
    }
    
    
    /* 
    ***************************************************************************
    * Initialize wolfSSL 
    * 
    *  WOLFSSL_API int wolfSSL_Init    (void)
    *
    *  Initializes the wolfSSL library for use. Must be called once per 
    *  application and before any other call to the library.
    *
    *  Returns
    *    SSL_SUCCESS  If successful the call will return.
    *    BAD_MUTEX_E  is an error that may be returned.
    *    WC_INIT_E    wolfCrypt initialization error returned.
    * 
    *  see: https://www.wolfssl.com/doxygen/group__TLS.html#gae2a25854de5230820a6edf16281d8fd7
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        /* only proceed if the prior step was successful */
        WOLFSSL_MSG("calling wolfSSL_Init");
        ret = wolfSSL_Init();

        if (ret == WOLFSSL_SUCCESS) {
            WOLFSSL_MSG("wolfSSL_Init successful\n");
        }
        else {
            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_Init failed\n");
        }
    }
    else {
        WOLFSSL_ERROR_MSG("Skipping wolfSSL_Init\n");
    }

    
    /* 
    ***************************************************************************
    * Create and initialize WOLFSSL_CTX (aka the context)
    * 
    *  WOLFSSL_API WOLFSSL_CTX* wolfSSL_CTX_new    (WOLFSSL_METHOD *)
    * 
    *  This function creates a new SSL context, taking a desired 
    *  SSL/TLS protocol method for input.
    *
    *  Returns
    *    pointer If successful the call will return a pointer to the newly-created WOLFSSL_CTX.
    *    NULL upon failure.
    *
    *  Parameters
    *    method pointer to the desired WOLFSSL_METHOD to use for the SSL context. 
    *    This is created using one of the wolfSSLvXX_XXXX_method() functions to
    *    specify SSL/TLS/DTLS protocol level.
    * 
    *  see https://www.wolfssl.com/doxygen/group__Setup.html#gadfa552e771944a6a1102aa43f45378b5
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        WOLFSSL_METHOD* method = wolfTLSv1_3_client_method();
        if (method == NULL) {
            WOLFSSL_ERROR_MSG("ERROR : failed to get  wolfTLSv1_3_client_method.\n");
            ret = WOLFSSL_FAILURE;
        }
        else {
            ctx = wolfSSL_CTX_new(method);

            if (ctx == NULL) {
                WOLFSSL_ERROR_MSG("ERROR : failed to create WOLFSSL_CTX\n");
                ret = WOLFSSL_FAILURE;
            }
        }
    }
    else {
        WOLFSSL_ERROR_MSG("skipping wolfSSL_CTX_new\n");
    }
    
    
    /* 
    ***************************************************************************
    *  load CERT_FILE 
    *  
    *  
    *  WOLFSSL_API int wolfSSL_use_certificate_buffer (WOLFSSL * ,
    *                                                  const unsigned char * ,
    *                                                  long,
    *                                                  int      
    *                                                  )
    *  
    *  The wolfSSL_use_certificate_buffer() function loads a certificate buffer 
    *  into the WOLFSSL object. It behaves like the non-buffered version, only 
    *  differing in its ability to be called with a buffer as input instead of 
    *  a file. The buffer is provided by the in argument of size sz. 
    *  
    *  format specifies the format type of the buffer; SSL_FILETYPE_ASN1 or 
    *  SSL_FILETYPE_PEM. Please see the examples for proper usage.
    *  
    *  Returns
    *    SSL_SUCCESS      upon success.
    *    SSL_BAD_FILETYPE will be returned if the file is the wrong format.
    *    SSL_BAD_FILE     will be returned if the file doesn’t exist, can’t be read, or is corrupted.
    *    MEMORY_E         will be returned if an out of memory condition occurs.
    *    ASN_INPUT_E      will be returned if Base16 decoding fails on the file.
    *  
    *  Parameters
    *    ssl    pointer to the SSL session, created with wolfSSL_new().
    *    in     buffer containing certificate to load.
    *    sz     size of the certificate located in buffer.
    *    format format of the certificate to be loaded. Possible values are SSL_FILETYPE_ASN1 or SSL_FILETYPE_PEM.
    *  
    *
    *  Pay attention to expiration dates and the current date setting
    *  
    *  see https://www.wolfssl.com/doxygen/group__CertsKeys.html#gaf4e8d912f3fe2c37731863e1cad5c97e
    ***************************************************************************
    */
//    if (ret == WOLFSSL_SUCCESS) {
//        WOLFSSL_MSG("Loading cert");
//        ret = wolfSSL_CTX_use_certificate_buffer(ctx, 
//            CERT_FILE, 
//            sizeof_CERT_FILE(), 
//            WOLFSSL_FILETYPE_PEM);
//
//        if (ret == WOLFSSL_SUCCESS) {
//            WOLFSSL_MSG("wolfSSL_CTX_use_certificate_buffer successful\n");
//        }
//        else {
//            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_CTX_use_certificate_buffer failed\n");
//        }
//    }
//    else {
//        WOLFSSL_ERROR_MSG("skipping wolfSSL_CTX_use_certificate_buffer\n");
//    }
        
    
