gojimmypi/wolfssl-examples/ESP32/TLS13-ENC28J60-server/main/enc28j60_example_main.c
    /* 
    ***************************************************************************
    *  Load client private key into WOLFSSL_CTX 
    *  
    *  wolfSSL_CTX_use_PrivateKey_buffer()
    *  
    *  WOLFSSL_API int wolfSSL_CTX_use_PrivateKey_buffer(WOLFSSL_CTX *,
    *                                                    const unsigned char *,
    *                                                    long,
    *                                                    int      
    *                                                   )
    *
    *  This function loads a private key buffer into the SSL Context. 
    *  It behaves like the non-buffered version, only differing in its 
    *  ability to be called with a buffer as input instead of a file. 
    *  
    *  The buffer is provided by the in argument of size sz. format 
    *  specifies the format type of the buffer; 
    *  SSL_FILETYPE_ASN1 or SSL_FILETYPE_PEM. 
    *  
    *  Please see the examples for proper usage.
    *
    *  Returns
    *    SSL_SUCCESS upon success
    *    SSL_BAD_FILETYPE will be returned if the file is the wrong format.
    *    SSL_BAD_FILE will be returned if the file doesn’t exist, can’t be read, or is corrupted.
    *    MEMORY_E will be returned if an out of memory condition occurs.
    *    ASN_INPUT_E will be returned if Base16 decoding fails on the file.
    *    NO_PASSWORD will be returned if the key file is encrypted but no password is provided.
    *
    *  Parameters
    *    ctx      pointer to the SSL context, created with wolfSSL_CTX_new().
    *             inthe input buffer containing the private key to be loaded.
    *    
    *    sz          the size of the input buffer.
    *    
    *    format  the format of the private key located in the input buffer(in). 
    *            Possible values are SSL_FILETYPE_ASN1 or SSL_FILETYPE_PEM.
    *
    *  see: https://www.wolfssl.com/doxygen/group__CertsKeys.html#ga71850887b87138b7c2d794bf6b1eafab
    ***************************************************************************
    */
//    if (ret == WOLFSSL_SUCCESS) {
//        ret = wolfSSL_CTX_use_PrivateKey_buffer(ctx, 
//                                                KEY_FILE, 
//                                                sizeof_KEY_FILE(), 
//                                                WOLFSSL_FILETYPE_PEM);
//        if (ret == WOLFSSL_SUCCESS) {
//            WOLFSSL_MSG("wolfSSL_CTX_use_PrivateKey_buffer successful\n");
//        }
//        else {
//            /* TODO fetch and print expiration date since it is a common fail */
//            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_CTX_use_PrivateKey_buffer failed\n");
//        }
//    }
//    else {
//        WOLFSSL_ERROR_MSG("Skipping wolfSSL_CTX_use_PrivateKey_buffer\n");
//    }

    
    /* 
    ***************************************************************************
    *  Load CA certificate into WOLFSSL_CTX 
    * 
    *  wolfSSL_CTX_load_verify_buffer()
    *  WOLFSSL_API int wolfSSL_CTX_load_verify_buffer(WOLFSSL_CTX *,
    *                                                 const unsigned char *,
    *                                                 long,
    *                                                 int      
    *                                                )        
    *                                                
    *  This function loads a CA certificate buffer into the WOLFSSL Context. 
    *  It behaves like the non-buffered version, only differing in its ability 
    *  to be called with a buffer as input instead of a file. The buffer is 
    *  provided by the in argument of size sz. format specifies the format type 
    *  of the buffer; SSL_FILETYPE_ASN1 or SSL_FILETYPE_PEM. More than one 
    *  CA certificate may be loaded per buffer as long as the format is in PEM.
    *  
    *  Please see the examples for proper usage.
    *  
    *  Returns
    *  
    *    SSL_SUCCESS upon success
    *    SSL_BAD_FILETYPE will be returned if the file is the wrong format.
    *    SSL_BAD_FILE will be returned if the file doesn’t exist, can’t be read, or is corrupted.
    *    MEMORY_E will be returned if an out of memory condition occurs.
    *    ASN_INPUT_E will be returned if Base16 decoding fails on the file.
    *    BUFFER_E will be returned if a chain buffer is bigger than the receiving buffer.
    *    
    *  Parameters
    *  
    *    ctx    pointer to the SSL context, created with wolfSSL_CTX_new().
    *    in    pointer to the CA certificate buffer.
    *    sz    size of the input CA certificate buffer, in.
    *    format    format of the buffer certificate, either SSL_FILETYPE_ASN1 or SSL_FILETYPE_PEM.
    *
    * see https://www.wolfssl.com/doxygen/group__CertsKeys.html#gaa37539cce3388c628ac4672cf5606785
    ***************************************************************************
    */
//    if (ret == WOLFSSL_SUCCESS) {
//        ret = wolfSSL_CTX_load_verify_buffer(ctx, CA_FILE, sizeof_CA_FILE(), WOLFSSL_FILETYPE_PEM);
//        if (ret == WOLFSSL_SUCCESS) {
//            WOLFSSL_MSG("wolfSSL_CTX_load_verify_buffer successful\n");
//        }
//        else {
//            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_CTX_load_verify_buffer failed\n");
//        }
//    }
//    else {
//        WOLFSSL_ERROR_MSG("skipping wolfSSL_CTX_load_verify_buffer\n");
//    }
    
    
    /* 
    ***************************************************************************
    *  Create a WOLFSSL object 
    *  
    *  The wolfSSL_new() function creates a new SSL session, taking an already 
    *  created SSL context as input.
    *
    *  wolfSSL_new() Returns:
    *  
    *     If successful the call will return a pointer to the newly-created 
    *     wolfSSL structure.
    *     
    *     NULL Upon failure.
    *     
    *  Parameters: WOLFSSL_API WOLFSSL* wolfSSL_new(WOLFSSL_CTX *)
    *  
    *    ctx  pointer to the SSL context, created with wolfSSL_CTX_new().
    *
    *  See: https://www.wolfssl.com/doxygen/group__Setup.html#ga3b1873a50ef7fcee4e2cc8968c81b6c9
    *  
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        ssl = wolfSSL_new(ctx);
        if (ssl == NULL) {
            WOLFSSL_ERROR_MSG("ERROR : failed to create WOLFSSL object\n");
            ret = WOLFSSL_FAILURE;
        }
    }
    else {
        WOLFSSL_ERROR_MSG("skipping wolfSSL_new\n");
    }


