gojimmypi/wolfssl-examples/ESP32/TLS13-ENC28J60-server/main/enc28j60_example_main.c
    /* 
    ***************************************************************************
    *  Attach wolfSSL to the socket using wolfSSL_set_fd()
    *  
    *  This function assigns a file descriptor (fd) as the input/output 
    *  facility for the SSL connection. Typically this will be a socket 
    *  file descriptor.
    *  
    *  wolfSSL_set_fd returns:
    *  
    *    SSL_SUCCESS upon success.
    *    Bad_FUNC_ARG upon failure.
    *    
    *  Parameters:
    *  
    *    ssl  pointer to the SSL session, created with wolfSSL_new().
    *    fd   file descriptor to use with SSL/TLS connection.
    *    
    *  see https://www.wolfssl.com/doxygen/group__Setup.html#ga4f23ec6e60cc92e0e899071653d3188b
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        ret = wolfSSL_set_fd(ssl, sockfd);
        if (ret == WOLFSSL_SUCCESS) {
            WOLFSSL_MSG("wolfSSL_set_fd successful\n");
        }
        else {
            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_set_fd failed\n");
        }
    }
    else {
        WOLFSSL_ERROR_MSG("skipping wolfSSL_set_fd\n");
    }


    /* 
    ***************************************************************************
    *  Connect to wolfSSL on the server side 
    *  
    *  This function is called on the client side and initiates an SSL/TLS 
    *  handshake with a server. When this function is called, the underlying 
    *  communication channel has already been set up. wolfSSL_connect() works 
    *  with both blocking and non-blocking I/O. When the underlying I/O is 
    *  non-blocking, wolfSSL_connect() will return when the underlying I/O 
    *  could not satisfy the needs of wolfSSL_connect to continue the 
    *  handshake. 
    *  
    *  In this case, a call to wolfSSL_get_error() will yield either 
    *  SSL_ERROR_WANT_READ or SSL_ERROR_WANT_WRITE. The calling process must 
    *  then repeat the call to wolfSSL_connect() when the underlying I/O 
    *  is ready and wolfSSL will pick up where it left off. 
    *  
    *  When using a non-blocking socket, nothing needs to be done, 
    *  but select() can be used to check for the required condition. 
    *  
    *  If the underlying I/O is blocking, wolfSSL_connect() will only return 
    *  once the handshake has been finished or an error occurred. wolfSSL takes 
    *  a different approach to certificate verification than OpenSSL does. 
    *  
    *  The default policy for the client is to verify the server, this means 
    *  that if you don't load CAs to verify the server you'll get a connect 
    *  error, unable to verify (-155). 
    *  
    *  If you want to mimic OpenSSL behavior of having SSL_connect succeed even 
    *  if verifying the server fails and reducing security you can do this by 
    *  calling: SSL_CTX_set_verify(ctx, SSL_VERIFY_NONE, 0); before 
    *  calling SSL_new(); Though it's not recommended.
    *  
    *  Returns:
    *  
    *    SSL_SUCCESS       If successful.
    *    SSL_FATAL_ERROR   will be returned if an error occurred. To get a more 
    *                      detailed error code, call wolfSSL_get_error().
    *    
    *  Parameters:
    *  
    *    ssl   a pointer to a WOLFSSL structure, created using wolfSSL_new().
    *
    *  see: https://www.wolfssl.com/doxygen/group__IO.html#ga5b8f41cca120758d1860c7bc959755dd
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        ret = wolfSSL_connect(ssl);
        if (ret == WOLFSSL_SUCCESS) {
            WOLFSSL_MSG("wolfSSL_connect successful\n");
        }
        else {
            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_connect failed\n");
        }
    }
    else {
        WOLFSSL_ERROR_MSG("skipping wolfSSL_connect\n");
    }
    

    /*
    ***************************************************************************
    *  send the message to the server 
    *  
    *  The wolfSSL_write() function writes sz bytes from the buffer, data, to 
    *  the SSL connection, ssl. If necessary, wolfSSL_write() will negotiate an 
    *  SSL/TLS session if the handshake has not already been performed yet by 
    *  wolfSSL_connect() or wolfSSL_accept(). wolfSSL_write() works with both 
    *  blocking and non-blocking I/O. 
    *  
    *  When the underlying I/O is non-blocking, wolfSSL_write() will return 
    *  when the underlying I/O could not satisfy the needs of wolfSSL_write() 
    *  to continue. In this case, a call to wolfSSL_get_error() will yield 
    *  either SSL_ERROR_WANT_READ or SSL_ERROR_WANT_WRITE. The calling process 
    *  must then repeat the call to wolfSSL_write() when the underlying I/O is 
    *  ready. 
    *  
    *  If the underlying I/O is blocking, wolfSSL_write() will only return once 
    *  the buffer data of size sz has been completely written or an error 
    *  occurred.
    *  
    *  wolfSSL_write() Returns:
    *  
    *    >0 the number of bytes written upon success.
    *    
    *    0 will be returned upon failure. Call wolfSSL_get_error() for 
    *    the specific error code.
    *    
    *    SSL_FATAL_ERROR will be returned upon failure when either an error 
    *    occurred or, when using non-blocking sockets, the SSL_ERROR_WANT_READ 
    *    or SSL_ERROR_WANT_WRITE error was received and and the application
    *    needs to call wolfSSL_write() again. Use wolfSSL_get_error() 
    *    to get a specific error code.
    *
    *  Parameters: 
    *  
    *    ssl    pointer to the SSL session, created with wolfSSL_new().
    *    data    data buffer which will be sent to peer.
    *    sz    size, in bytes, of data to send to the peer (data).
    *    
    *  see: https://www.wolfssl.com/doxygen/group__IO.html#ga74b924a81e9efdf66d074690e5f53ef1
    *
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {

        memset(buff, 0, BUFF_SIZE);
    
        /* get the length of our message, never longer than the declared size */
        
        /* TODO check for zero length */
        
        len = strnlen(sendMessage, sendMessageSize);
        
        /* write the message over secure connection to the server */
        if (wolfSSL_write(ssl, sendMessage, len) == len) {

