gojimmypi/wolfssl-examples/ESP32/TLS13-ENC28J60-server/main/enc28j60_example_main.c
            WOLFSSL_MSG("wolfSSL_write message sent successfully:\n");
            WOLFSSL_MSG(sendMessage);
        }
        else {

            int err = 0;
            err = wolfSSL_get_error(ssl, 0);

            char err_buff[80];
            wolfSSL_ERR_error_string(err, err_buff);
            WOLFSSL_ERROR_MSG(err_buff);

            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_write FAILED.\n");
            ret = WOLFSSL_FAILURE;
        }
    }
    else {
        WOLFSSL_ERROR_MSG("Skipping wolfSSL_write\n");
    }
   

    /* 
    ***************************************************************************
    * 
    *  Read the server data into our buff array 
    *  
    *  The wolfSSL_read() function reads sz bytes from the SSL session (ssl) 
    *  internal read buffer into the buffer data. The bytes read are removed 
    *  from the internal receive buffer. If necessary wolfSSL_read() will 
    *  negotiate an SSL/TLS session if the handshake has not already been 
    *  performed yet by wolfSSL_connect() or wolfSSL_accept(). The SSL/TLS 
    *  protocol uses SSL records which have a maximum size of 16kB (the max 
    *  record size can be controlled by the MAX_RECORD_SIZE define in 
    *  <wolfssl_root>/wolfssl/internal.h). 
    *  
    *  As such, wolfSSL needs to read an entire SSL record internally before 
    *  it is able to process and decrypt the record. Because of this, a call 
    *  to wolfSSL_read() will only be able to return the maximum buffer size 
    *  which has been decrypted at the time of calling. There may be additional
    *  not-yet-decrypted data waiting in the internal wolfSSL receive buffer 
    *  which will be retrieved and decrypted with the next call to 
    *  wolfSSL_read(). 
    *  
    *  If sz is larger than the number of bytes in the internal read buffer, 
    *  SSL_read() will return the bytes available in the internal read buffer. 
    *  If no bytes are buffered in the internal read buffer yet, a call to 
    *  wolfSSL_read() will trigger processing of the next record.

    *  Returns
    *  
    *   >0 the number of bytes read upon success.
    *   
    *   0 will be returned upon failure. This may be caused by a either a clean
    *   (close notify alert) shutdown or just that the peer closed the 
    *   connection. Call wolfSSL_get_error() for the specific error code.
    *   
    *   SSL_FATAL_ERROR will be returned upon failure when either an error 
    *   occurred or, when using non-blocking sockets, the 
    *   SSL_ERROR_WANT_READ or SSL_ERROR_WANT_WRITE error was received and 
    *   the application needs to call wolfSSL_read() again. 
    *   
    *   Use wolfSSL_get_error() to get a specific error code.
    *   
    *  Parameters
    *  
    *   ssl    pointer to the SSL session, created with wolfSSL_new().
    *   data    buffer where wolfSSL_read() will place data read.
    *   sz    number of bytes to read into data.
    *   
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        /* even though the result should be a zero-terminated string, 
         * we'll clear the receive buffer */
        memset(buff, 0, BUFF_SIZE);
        
        /* read the response data from our secure connection */
        if (wolfSSL_read(ssl, buff, BUFF_SIZE - 1) > 0) {
            
            /* one or more bytes received is considered success */
            
            /* Print to stdout any data the server sends */
            WOLFSSL_MSG("wolfSSL_read received message:\n");    
            WOLFSSL_MSG(buff);
        }
        else {
            /* get the integer error value */
            int err = 0;
            err = wolfSSL_get_error(ssl, 0);

            /* get the human-readable error string. */
            char err_buff[80] = "\x0";
            wolfSSL_ERR_error_string(err, err_buff);
            WOLFSSL_ERROR_MSG(err_buff);
            
            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_read FAILED.\n");
            ret = WOLFSSL_FAILURE;
        }
    }
    

    /* 
    ***************************************************************************
    *    
    *    Cleanup and return 
    *    
    ***************************************************************************
    */
    if (sockfd != SOCKET_INVALID) {
        close(sockfd); /* Close the connection to the server       */
    }
    
    if (ssl) {
        wolfSSL_free(ssl); /* Free the wolfSSL object                  */
    }
    
    if (ctx) {
        wolfSSL_CTX_free(ctx); /* Free the wolfSSL context object          */
    }
    
    wolfSSL_Cleanup(); /* Cleanup the wolfSSL environment          */

    WOLFSSL_LEAVE("tls_smp_client_task", ret);
    WOLFSSL_MSG("tls_smp_client_task done!\n");
    return ret;
}


/** Event handler for Ethernet events */
static void eth_event_handler(void *arg,
    esp_event_base_t event_base,
    int32_t event_id,
    void *event_data) {
    uint8_t mac_addr[6] = { 0 };
    /* we can get the ethernet driver handle from event data */
    esp_eth_handle_t eth_handle = *(esp_eth_handle_t *)event_data;

    switch (event_id) {
    case ETHERNET_EVENT_CONNECTED:
        /*
         * see ESP-IDF 5.0 note at 
         * https://docs.espressif.com/projects/esp-idf/en/latest/esp32/migration-guides/ethernet.html
         * 
         * esp_eth_ioctl() third argument could take int (bool) number as an input in some cases.
         * However, it was not properly documented and, in addition, the number had to be “unnaturally” 
         * type casted to void * datatype to prevent compiler warnings as shown in below example:
         * 
         * esp_eth_ioctl(eth_handle, ETH_CMD_S_FLOW_CTRL, (void *)true);
         *
         * This could lead to misuse of the esp_eth_ioctl(). Therefore, ESP-IDF 5.0 unified usage of 
         * esp_eth_ioctl(). Its third argument now always acts as pointer to a memory location of specific 
         * type from/to where the configuration option is read/stored.
         * 
         * TODO Migrate Ethernet Drivers to ESP-IDF 5.0
         
